#pragma once
#include "n160_100_bitboard.hpp"


//────────────────────────────────────────────────────────────────────────────────
// ビットボード　＞　出力
//────────────────────────────────────────────────────────────────────────────────


/// <summary>
/// ビットボードの出力
/// </summary>
class PrintBb
{


public:


	//────────────────────────────────────────────────────────────────────────────────
	// その他
	//────────────────────────────────────────────────────────────────────────────────


	/// <summary>
	/// for debug	//const
	/// </summary>
	/// <param name="thisBitboard"></param>
	static void PrintBoard(const Bitboard* thisBitboard);
};
